#include <stdio.h>
// დაწერეთ პროგრამა, რომელიც დაადგენს თუ რამდენი დღე გავიდა წლის
// დასაწყისიდან (1 იანვრიდან). ჩათვალეთ, რომ მიმდინარე წელი ნაკიანი არ
// არის.
// შესატანი მონაცემები: ერთადერთ სტრიქონში ორი მთელი რიცხვი, რომლებიც
// განსაზღვრავენ მიმდინარე თარიღს. პირველი აღნიშნავს თვის ნომერს, ხოლო
// მეორე - რიცხვს.
// გამოსატანი მონაცემები: ერთი მთელი რიცხვი, რომელიც აღნიშნავს თუ მიმდინარე
// თარიღი მერამდენე დღეა წლის დასაწყისიდან.
// შესატანი მონაცემები
// 4 14
// გამოსატანი მონაცემები
// 104
// შესატანი მონაცემები
// 1 31
// გამოსატანი მონაცემები
// 31

int main(){
    int inputed_month, inputed_days;
    printf("შემოიყვანეთ თვე და რიცხვი გამოტოვებით[მინიშნება: 1 14 (14 იანვარი)] :\t");
    scanf("%d %d", &inputed_month, &inputed_days);
    int array_of_days[12] = { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 };
    //                         1   2   3   4   5   6   7   8   9  10  11  12

    int counter = 0, days_passed = 0;

    for (int i = 0; i < 12; i++)
    {
        while (counter < inputed_month - 1)
        {
            days_passed += array_of_days[counter];
            counter++;
        }
        days_passed += inputed_days;
        break;
    }
    
    printf("ამ წლის პირველი დღიდან დღევანდელ დღემდე გასულია : %d-დღე\n", days_passed);
    
    return 0;
}