#include <stdio.h>
// მოცემულია N ცალი კალათა და A ცალი ვაშლი
// (1<=A<=N<=100000). ყოველ კალათაში ერთი მაინც ვაშლი
// უნდა იდოს. დაადგინეთ, რა მინიმალური და მაქსიმალური
// რაოდენობის ვაშლი შეიძლება იდოს იმ კალათაში,
// რომელშიც ყველაზე მეტი ვაშლი დევს.
//
// შესატანი მონაცემები: ორი მთელი რიცხვი - A და N.
//
// გამოსატანი მონაცემები: ორი მთელი რიცხვი - ვაშლების
// მინიმალური და მაქსიმალური რაოდენობა იმ კალათაში,
// რომელშიც ყველაზე მეტი ვაშლი დევს.
//
// შესატანი მონაცემები
// 7 3
//
// გამოსატანი მონაცემები
// 3 5

int main(){
    int kalata, vashli, max, min;
    kalata = 3;
    vashli = 7;
    // აქ მაქსიმუმის გამოთვლისას ვიყენებთ მზგავს ალგორითმს:
    // ვაშლების რაოდენობას უნდა გამოვაკლოთ კალათების რაოდენობა,
    // რომ მივიღოთ ყველა კალათაში თითო ვაშლი, ხოლო შემდეგ დარჩენილ
    // რაოდენობას ჩავყრით რომელიმე ერთ კალათაში და ამით მივიღებთ
    // მაქსიმუმ რაოდენობას
    // მოცემული გვაქვს 3 კალათა და 7 ვაშლი, 
    // 7 - 3 = 4 ანუ თითო კალათაში 1 1 1 ვაშლი მოექცა და დაგვრჩა 4 ვაშლი
    // ეხლა ეს 4 ვაშლი უნდა დავაყაროთ რომელიმე კალათას და შესაბამისად 
    // ამ 4-ს უნდა დავამატოთ 1 და მივიღეთ სასურველი მაქსიმალური რაოდენობა [1] [1] [5]
    max = vashli - kalata + 1;

    // აქ მინიმუმის შემთხვევაში ვიყენებთ მზგავს ალგორითმს:
    // ვყოფთ ვაშლების რაოდენობას კალათების რაოდენობაზე, რადგან
    // გავიგოთ რამდენი ვაშლი გადანაწილდება მაქსიმუმ კალათებში და შემდეგ
    // დარჩენილ ნაშთს ვამატებთ ერთ-ერთ კალათს და ამით მივიღებთ მინიმუმ რაოდენობას
    // მოცემული გვაქ 3 კალათა და 7 ვაშლი,
    // 7 / 3 = 2 ანუ თითო კალათაში 2 2 2 გადანაწილდება 
    // ამის შემდეგ დაგვრჩება ნაშთი 1
    // რომელსაც რომელიმე კალათას დავაყრით და მივიღებთ 2 + 1 = 3
    // ამ ყველაფრით მივიღეთ სასურველი შედეგი [2] [2] [3]
    min = (vashli / kalata) + (vashli % kalata);

    printf("\nMax : %d\nMin : %d\n\n", max, min); 

    return 0;
}
