#include <stdio.h>
// მოცემულია სამნიშნა რიცხვი. გამოთვალეთ მისი გაყოფის
// ნაშთები საკუთარ ციფრებზე. არცერთი ციფრი არ არის 0-ის
// ტოლი.

// შესატანი მონაცემები: ერთადერთ სტრიქონში ერთი სამნიშნა
// რიცხვი.

// გამოსატანი მონაცემები: სამი მთელი რიცხვი - მოცემული
// რიცხვის გაყოფის ნაშთი მისსავე ასეულების, ათეულები და
// ერთეულების თანრიგში მდგომ რიცხვებზე შესაბამისი
// თანმიმდევრობით.

// შესატანი მონაცემები
// 754

// გამოსატანი მონაცემები
// 5 4 2

int main(){
    int x, erteuli, ateuli, aseuli;
    x = 754;

    erteuli = x % 10; // 75[4]
    ateuli = (x / 10) % 10; // 7[4]5
    aseuli = x / 100; // [7]45

    printf("%d %d %d\n", (x % aseuli), (x % ateuli), (x % erteuli));

    return 0;
}