#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/*
ავარიული სიტუაციის გამო გადაწყდა თვითმფრინავი დასვან საავტომობილო მაგისტრალზე, 
რომელიც შეიძლება წარმოვიდგინოთ, როგორც N თანაბარ ნაწილად დაყოფილი მონაკვეთი. 
თითოეულ ნაწილს გააჩნია საკუთარი სიმაღლე. 
პილოტებს სჭირდებათ გზის ნაწილების ყველაზე გრძელი უწყვეტი მიმდევრობა,
რომელშიც შემავალ ნაწილებს ერთნაირი სიმაღლე აქვთ.
შესატანი მონაცემები: 
პირველ სტრიქონში მოცემულია ერთი მთელი რიცხვი N (0 < N < 3000) - გზის ნაწილების რაოდენობა.
მომდევნო N სტრიქონიდან თითოეულში მოცემულია თითო მთელი დადებითი რიცხვი - შესაბამისი ნაწილის სიმაღლე.

გამოსატანი მონაცემები: 
ერთადერთ სტრიქონში გამოიტანეთ ერთი მთელი რიცხვი - 
ერთნაირი სიმაღლის ნაწილებისაგან შედგენილი ყველაზე გრძელი უწყვეტი მიმდევრობის სიგრძე.

შესატანი მონაცემები                     გამოსატანი მონაცემები
13                                      4
5 5 6 7 7 7 7 6 6 5 4 4 4
*/

void print_answer(int size, int arr[size]);

int main()
{
    int array[13] = { 5, 5, 6, 7, 7, 7, 7, 6, 6, 5, 4, 4, 4 };

    print_answer(13, array);

    return 0;
}


void print_answer(int size, int arr[size]){
    int max = 1, len = 1;

    for (int i = 0; i < size; i++)
    {
        if (arr[i] == arr[i - 1])
        {
            len++;
        }
        else
        {
            if (max < len)
            {
                max = len;
                len = 1;
            }
        }
    }

    printf("Max length : %d\n", max);
}