#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/*
• უნივერსიტეტში ახალი ლექტორი მოიყვანეს. ამ უნივერსიტეტში სტუდენტის ზოგადი შეფასების სისტემა ასეთია:
    1)ყველა სტუდენტი იღებს ნიშანს 0-დან 100-ის ჩათვლით.
    2)ნებისმიერი ქულა 40-ის დაბლა ჩამჭრელ ქულად ითვლება.
    ახალი ლექტორის ჰობია სტუდენტების ნიშნების შემდეგი წესებიშ თანახმად დამრგვალება
    თუ სტუდენტის ნიშანსა და მასზე დიდ უახლოეს
    5-ის გამყობ რიცხვს შორის სხვაობა 3-ზე ნაკლებია,
    ნიშანს ამრგვალებს შემდგომ უახლოეს 5-ის გამყოფამდე.
    შენიშვნა: თუ სტუდენტის ნიშანი 38-ზე ნაკლებია
    არანაირი დამრგვალება არ ხდება და ეს ნიშანი ჩამჭრელ ნიშნად რჩება.
    მაგალითად ნიშანი=84 დამრგვალდება 85-ამდე. 
    ნიშანი-29 არ დამრგვალდება იმიტომ რომ ის 40-ზე ნაკლებია.
• დაწერეთ პრობრამა, რომელიც სტუდენტის ნიშნების მოცემულ სიმრავლეს დაამრგვალებს ზემოთ მოცემული წესების მიხედვით
*/

int func();

int main()
{
    func();

    return 0;
}


int func(){
    int number;
    printf("Input Number: ");
    scanf("%d", &number);

    if (number < 40)
    {
        printf("You Fail\n");
    }
    else
    {
        int x = 5 - number % 5;

        if (x < 3) printf("You Passed %d\n", number + x);
        else printf("You Passed %d\n", number);
        
    }
    
}
